Publ/Lenguajes/Kotlin/Kotlin.html
<!doctype html>
<html lang="en">
<head>
<title>Kotlin</title>
<!-- 2022-03-25 Fri 01:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Introducción</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Qué es la JVM</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Conceptos Básicos</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Jerarquía de archivos de un proyecto de kotlin</a></li>
<li><a href="#sec-2-2">2.2. Introducción</a></li>
<li><a href="#sec-2-3">2.3. Hello World</a></li>
<li><a href="#sec-2-4">2.4. Tipos de datos</a></li>
<li><a href="#sec-2-5">2.5. Variables</a></li>
<li><a href="#sec-2-6">2.6. Inferencia de tipos</a></li>
<li><a href="#sec-2-7">2.7. Operadores</a></li>
<li><a href="#sec-2-8">2.8. Operadores de asignación</a></li>
<li><a href="#sec-2-9">2.9. Operadores de comparación</a></li>
<li><a href="#sec-2-10">2.10. Comentarios</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Kotlin</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introducción</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Qué es la JVM</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><code>Java virtual Machine</code>.
</li>
<li>La JVM funciona como punto medio entre el código que escribimos y
lo que entiende el sistema operativo.
</li>
<li>La JVM lee el bytecode que resulta de nuestro código.
</li>
<li>Java también produce bytecode.
<ul class="org-ul">
<li>Podemos utilizar java y kotlin al mismo tiempo porque ambos se convierten a bytecode.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Conceptos Básicos</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Jerarquía de archivos de un proyecto de kotlin</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Carpeta <code>Gradle</code>
<ul class="org-ul">
<li>Nos permite gestionar las dependencias de nuestro proyecto y compilar nuestro proyecto.
</li>
</ul>
</li>
<li>Carpeta <code>Build</code>
<ul class="org-ul">
<li>En la cual se encuentra todo nuestro código compilado previamente por gradle
</li>
</ul>
</li>
<li>Carpeta <code>src</code>
<ul class="org-ul">
<li>En la que se encuentra nuestro código.
</li>
</ul>
</li>
<li>Carpeta <code>Test</code>.
<ul class="org-ul">
<li>Es en la que se encuentran todos los Test de nuestra aplicación.
</li>
</ul>
</li>
<li>Archivo <code>build.gradle.kts</code>
<ul class="org-ul">
<li>La configuración de nuestro proyecto.
<ul class="org-ul">
<li>Dependencias.
</li>
<li>Versión de kotlin.
</li>
</ul>
</li>
<li>Archivo <code>gradle.properties</code>
<ul class="org-ul">
<li>Nos permite declarar propiedades de proyecto
</li>
</ul>
</li>
<li>Ejecutables <code>gradlew</code> y <code>gradlew.bat</code>
<ul class="org-ul">
<li>Ejecutables de gradle para diferentes plataformas.
</li>
</ul>
</li>
<li>Archivo <code>settings.gradle.kts</code>
<ul class="org-ul">
<li>Donde especificamos las propiedades del proyecto.
<ul class="org-ul">
<li>Como el nombre.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Introducción</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Es consiso, seguro y pragmático
</li>
<li>Diseñado para interoperar con código en java.
</li>
<li>Puede ser usado en todos los lugares donde se usa java.
</li>
<li>Google anuncio que el desarrollo de android es &ldquo;kotlin first&rdquo;.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Hello World</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>La función <code>main</code> es el punto de entrada de cada programa de kotlin.
</li>
<li></li>
</ul>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">fun</span> <span style="color: #50fa7b;">main</span><span style="color: #61bfff;">(</span>args : <span style="color: #bd93f9;">Array&lt;String&gt;</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
    println<span style="color: #ff79c6;">(</span><span style="color: #f1fa8c;">"Hello World"</span><span style="color: #ff79c6;">)</span>
<span style="color: #61bfff;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Tipos de datos</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Cada valor debe de tener un tipo.
</li>
<li>Algunos de los más usados son:
<ul class="org-ul">
<li><code>int</code> : números enteros.
</li>
<li><code>Double</code> : números decimales.
</li>
<li><code>Char</code> : Representan un carácter.
</li>
<li><code>Boolean</code> : Representan <b>verdadero</b> o <b>falso</b>
</li>
</ul>
</li>
<li>El tipo de dato <code>String</code> es usado para representar texto (cadenas de caracteres).
<ul class="org-ul">
<li>Los <code>String</code> van delimitados con comillas dobles.
</li>
<li>Podemos usar <code>\n</code> para crear un salto de línea.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-kotlin">println<span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">"A \n B \n C \n"</span><span style="color: #61bfff;">)</span>
</pre>
</div>

<pre class="example">
A
B
C
</pre>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Variables</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Son usadas para guardar datos.
</li>
<li>Cada variable tiene un tipo, que define el tipo de la variable.
</li>
<li>Se declaran usando la palabra <code>var</code>.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">num</span> : <span style="color: #bd93f9;">Int</span> = <span style="color: #bd93f9; font-weight: bold;">42</span>
</pre>
</div>

<p>
Con esto tenemos una variable de llamada <code>num</code> de tipo <code>Int</code> que vale 42.
</p>

<p>
Ahora podríamos imprimir el resultado usando <code>println</code>.
</p>

<div class="org-src-container">

<pre class="src src-kotlin">num = <span style="color: #bd93f9; font-weight: bold;">8</span> <span style="color: #6272a4; font-style: italic;">// </span><span style="color: #6272a4; font-style: italic;">Podemos cambiar el valor de num</span>
println<span style="color: #61bfff;">(</span>num<span style="color: #61bfff;">)</span>
</pre>
</div>

<p>
También podemos declarar variables usando la palabra <code>val</code>.
</p>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">val</span> <span style="color: #ffc9e8;">course</span> : <span style="color: #bd93f9;">String</span> = <span style="color: #f1fa8c;">"Kotlin"</span>
println<span style="color: #61bfff;">(</span>course<span style="color: #61bfff;">)</span>
</pre>
</div>

<p>
La diferencia es que las variables declaradas con <code>val</code> no se pueden cambiar, son inmutables.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Inferencia de tipos</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Kotlin soporta inferencia de tipos.
<ul class="org-ul">
<li>Esto le permite adivinar el tipo de la variable con el valor que se le asigna.
</li>
<li>Esto nos permite saltarnos la definición de tipos.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">val</span> <span style="color: #ffc9e8;">name</span> = <span style="color: #f1fa8c;">"James"</span>
<span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">num</span> = <span style="color: #bd93f9; font-weight: bold;">42</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Operadores</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Kotlin soporta todos los operadores aritméticos comunes.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">num1</span> = <span style="color: #bd93f9; font-weight: bold;">8</span>
<span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">num2</span> = <span style="color: #bd93f9; font-weight: bold;">34</span>

println<span style="color: #61bfff;">(</span>num1 + num2<span style="color: #61bfff;">)</span>
println<span style="color: #61bfff;">(</span>num1 - num2<span style="color: #61bfff;">)</span>
println<span style="color: #61bfff;">(</span>num1 * num2<span style="color: #61bfff;">)</span>
println<span style="color: #61bfff;">(</span>num1 / num2<span style="color: #61bfff;">)</span>
println<span style="color: #61bfff;">(</span>num1 % num2<span style="color: #61bfff;">)</span>
</pre>
</div>

<p>
También podemos usar el operador de <code>+</code> para concatenar <code>strings</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Operadores de asignación</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Podemos convinar el operador de asignación <code>=</code>  junto con operadores aritméticos para hacer ambas operaciones.
</p>

<p>
Por ejemplo <code>a+=b</code> es equivalente a <code>a = a+b</code>.
</p>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">num</span> = <span style="color: #bd93f9; font-weight: bold;">4</span>
num *= <span style="color: #bd93f9; font-weight: bold;">5</span>

println<span style="color: #61bfff;">(</span>num<span style="color: #61bfff;">)</span>
</pre>
</div>

<p>
Kotlin también soporta los operadores de incremento y decremento <code>++</code> y <code>--</code>.
</p>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">num</span> = <span style="color: #bd93f9; font-weight: bold;">8</span>
num++
println<span style="color: #61bfff;">(</span>num<span style="color: #61bfff;">)</span>
</pre>
</div>

<p>
Los operadores de incremento y decremento tienen dos versiones:
</p>
<ul class="org-ul">
<li><code>prefix</code>
<ul class="org-ul">
<li>Antes del nombre de la variable
</li>
<li>Este incrementa la variable y luego usa el número.
</li>
</ul>
</li>
<li><code>posfix</code>
<ul class="org-ul">
<li>Después del nombre de la variable
</li>
<li>Este usa el valor de la variable primero y luego lo incrementa.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Operadores de comparación</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Kotlin contiene todos los operadores de comparación comunes.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-kotlin"><span style="color: #ff79c6; font-style: italic;">var</span> <span style="color: #ffc9e8;">age</span> = <span style="color: #bd93f9; font-weight: bold;">18</span>
println<span style="color: #61bfff;">(</span>age &gt;= <span style="color: #bd93f9; font-weight: bold;">16</span><span style="color: #61bfff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Comentarios</h3>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-03-25 Fri 01:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
